use std::io;
use regex::Regex;
use std::process;
use std::collections::HashMap;

fn is_nihongo(val: &str) -> bool {
    let re = Regex::new(r"[\p{Hiragana}|\p{Katakana}|\s]").unwrap();

    return re.is_match(val);
}

fn translate(string: &str) {
    let map: HashMap<char, char> = [
        ('あ', '安'), ('い', '以'), ('う', '宇'), ('え', '衣'), ('お', '於'),  
        ('か', '加'), ('き', '幾'), ('く', '久'), ('け', '計'), ('こ', '己'), 
        ('さ', '左'), ('し', '之'), ('す', '寸'), ('せ', '世'), ('そ', '曽'), 
        ('た', '太'), ('ち', '知'), ('つ', '川'), ('て', '天'), ('と', '止'), 
        ('な', '奈'), ('に', '仁'), ('ぬ', '奴'), ('ね', '祢'), ('の', '乃'), 
        ('は', '波'), ('ひ', '比'), ('ふ', '不'), ('へ', '部'), ('ほ', '保'), 
        ('ま', '末'), ('み', '美'), ('む', '武'), ('め', '女'), ('も', '毛'), 
        ('や', '也'), ('ゆ', '由'), ('よ', '与'), 
        ('ら', '良'), ('り', '利'), ('る', '留'), ('れ', '礼'), ('ろ', '呂'), 
        ('わ', '和'), ('ゐ', '為'), ('ん', '无'), ('ゑ', '恵'), ('を', '遠'),
        ('ア', '阿'), ('イ', '伊'), ('ウ', '宇'), ('エ', '江'),('オ', '於'),
        ('カ', '加'), ('キ', '機'), ('ク', '久'), ('ケ', '介'), ('コ', '己'),
        ('サ', '散'), ('シ', '之'), ('ス', '須'), ('セ', '世'), ('ソ', '曽'),
        ('タ', '多'), ('チ', '千'), ('ツ', '川'), ('テ', '天'), ('ト', '止'),
        ('ナ', '奈'), ('ニ', '仁'), ('ヌ', '奴'), ('ネ', '祢'), ('ノ', '乃'),
        ('ハ', '八'), ('ヒ', '比'), ('フ', '不'), ('ヘ', '部'), ('ホ', '保'),
        ('マ', '末'), ('ミ', '三'), ('ム', '牟'), ('メ', '女'), ('モ', '毛'),
        ('ヤ', '也'), ('ユ', '由'), ('ヨ', '與'), 
        ('ラ', '良'), ('リ', '利'), ('ル', '流'), ('レ', '礼'), ('ロ', '呂'),
        ('ワ', '和'), ('ヰ', '井'), ('ン', '尓'), ('ヱ', '恵'), ('ヲ', '乎'),
    ].iter().cloned().collect();

    // let mut s = String::new();
    for c in string.chars() {
        println!("{}", map[&c]);
        // s.push(map[&c]);
    }

    // println!("{}", s);
        
}
 
fn main() {
    println!("Please input something Nihongo.");

    let mut string = String::new();

    io::stdin()
        .read_line(&mut string)
        .expect("Failed to read line");

    if is_nihongo(&string) {
        translate(&string);
    } else {
        println!("Invalid input value.");
        process::abort();
    };
}
