use std::io;
use std::collections::HashMap;

fn dictionary() -> HashMap<char, char> {
    let m: HashMap<char, char> = [
        ('あ', '安'), ('い', '以'), ('う', '宇'), ('え', '衣'), ('お', '於'),  
        ('ぁ', '安'), ('ぃ', '以'), ('ぅ', '宇'), ('ぇ', '衣'), ('ぉ', '於'),  
        ('か', '加'), ('き', '幾'), ('く', '久'), ('け', '計'), ('こ', '己'), 
        ('が', '加'), ('ぎ', '幾'), ('ぐ', '久'), ('げ', '計'), ('ご', '己'), 
        ('さ', '左'), ('し', '之'), ('す', '寸'), ('せ', '世'), ('そ', '曽'), 
        ('ざ', '左'), ('じ', '之'), ('ず', '寸'), ('ぜ', '世'), ('ぞ', '曽'), 
        ('た', '太'), ('ち', '知'), ('つ', '川'), ('て', '天'), ('と', '止'), 
        ('だ', '太'), ('ぢ', '知'), ('づ', '川'), ('で', '天'), ('ど', '止'), 
        ('な', '奈'), ('に', '仁'), ('ぬ', '奴'), ('ね', '祢'), ('の', '乃'), 
        ('は', '波'), ('ひ', '比'), ('ふ', '不'), ('へ', '部'), ('ほ', '保'), 
        ('ば', '波'), ('び', '比'), ('ぶ', '不'), ('べ', '部'), ('ぼ', '保'), 
        ('ま', '末'), ('み', '美'), ('む', '武'), ('め', '女'), ('も', '毛'), 
        ('や', '也'), ('ゆ', '由'), ('よ', '与'), 
        ('ゃ', '也'), ('ゅ', '由'), ('ょ', '与'), ('っ', '川'), ('ゎ', '和'),
        ('ら', '良'), ('り', '利'), ('る', '留'), ('れ', '礼'), ('ろ', '呂'), 
        ('わ', '和'), ('ゐ', '為'), ('ん', '无'), ('ゑ', '恵'), ('を', '遠'),
        ('ア', '阿'), ('イ', '伊'), ('ウ', '宇'), ('エ', '江'),('オ', '於'),
        ('カ', '加'), ('キ', '機'), ('ク', '久'), ('ケ', '介'), ('コ', '己'),
        ('ガ', '加'), ('ギ', '機'), ('グ', '久'), ('ゲ', '介'), ('ゴ', '己'),
        ('サ', '散'), ('シ', '之'), ('ス', '須'), ('セ', '世'), ('ソ', '曽'),
        ('ザ', '散'), ('ジ', '之'), ('ズ', '須'), ('ゼ', '世'), ('ゾ', '曽'),
        ('タ', '多'), ('チ', '千'), ('ツ', '川'), ('テ', '天'), ('ト', '止'),
        ('ダ', '多'), ('ヂ', '千'), ('ヅ', '川'), ('デ', '天'), ('ド', '止'),
        ('ナ', '奈'), ('ニ', '仁'), ('ヌ', '奴'), ('ネ', '祢'), ('ノ', '乃'),
        ('ハ', '八'), ('ヒ', '比'), ('フ', '不'), ('ヘ', '部'), ('ホ', '保'),
        ('バ', '八'), ('ビ', '比'), ('ブ', '不'), ('ベ', '部'), ('ボ', '保'),
        ('マ', '末'), ('ミ', '三'), ('ム', '牟'), ('メ', '女'), ('モ', '毛'),
        ('ヤ', '也'), ('ユ', '由'), ('ヨ', '與'), 
        ('ャ', '也'), ('ュ', '由'), ('ョ', '與'), ('ッ', '川'), ('ヮ', '和'),
        ('ラ', '良'), ('リ', '利'), ('ル', '流'), ('レ', '礼'), ('ロ', '呂'),
        ('ワ', '和'), ('ヰ', '井'), ('ン', '尓'), ('ヱ', '恵'), ('ヲ', '乎'),
    ].iter().cloned().collect();

    return m;
}

fn input() -> String {
    println!("ひらがな or カタカナ を入力\n> ");

    let mut s = String::new();
    io::stdin()
        .read_line(&mut s)
        .expect("Failed to read line");

    return s;
}

fn translate(s: &str) {
    let m = dictionary();
    let mut result = String::new();
    for c in s.chars() {
        if (m.contains_key(&c)) {
            result.push(m[&c]);
        }
    }

    println!("\n結果 > {}\n\n", result);
}
 
fn main() {
    loop{
        translate(&input());
    }
}
